#!/bin/bash

# Отримуємо поточну дату і час у форматі YYYY-MM-DD_HH-MM-SS
current_datetime=$(date +%Y-%m-%d_%H-%M-%S)

# Додаємо ASCII-арт та вивід Python-програми в файл
cat << EOF > tests/output_${current_datetime}.txt
+---------------------+---------------------+---------------------+---------------------+---------------------+
| Процент   | Фандинг  | Прибиль (%) | Дохід ($) | Комісія | Об'єм ($) | В сделкі ? | Тікет |
+---------------------+---------------------+---------------------+---------------------+---------------------+
|           |           |           |           |           |           |           |           |
|[  1.22% ] |[ -0.046$ ]|[  0.012$ ]| [ 0.066$ ]|[ 0.0081$] |[  5.36$ ] | [   5c   ] | CUDISUSDT |
|           |           |           |           |           |           |           |           |
+---------------------+---------------------+---------------------+---------------------+---------------------+

EOF
