#!/bin/bash

# Отримуємо поточну дату і час у форматі YYYY-MM-DD_HH-MM-SS
current_datetime=$(date +%Y-%m-%d_%H-%M-%S)

# Додаємо ASCII-арт та вивід Python-програми в файл
cat << EOF > tests/output_${current_datetime}.txt
+---------------------+---------------------+---------------------+---------------------+---------------------+
Процент|Фандинг|Прибиль|Дохід| Комісія |Об'єм|В сделкі|Тікет |
+---------------------+---------------------+---------------------+---------------------+---------------------+
|           |           |           |           |           |           |           |           |
 2,54%  -2,09 $  0,40 $  2,65 $  0,16 $  103 $  4с  MYXUSDT |           |           |           |           |           |           |           |           |
+---------------------+---------------------+---------------------+---------------------+---------------------+

EOF
